{
	"name": "Burghert's Lair",
	"mapLocation": false,
	"music": false,

	"walls": [
		[0,259, 279,259, 274,292, 0,566],

		[285,205, 774,205, 774,283, 285,283], 

        [815,293, 980,293, 980,384, 878,384],

		[947,468, 1024,468, 1024,566, 980,513],

        [747,326, 812,328, 860,373, 792,374],

        [0,576, 1024,576, 1024,600, 0,600]
	],

	"NPCs": {
		"burghert": {
			"profile": {
				"name": "Burghert",
				"color": "#FFFFFF",
				"head": false,
				"face": false,
				"body": false
			},
			"image": "burghert",
			"x": 513,
			"y": 326,
			"facing": "down",
			"speechBubble": ["Well well well..."],
			"dialogue": [
				{
					"text": [
         				"So, you found me. Now what? Are you gonna kill me?", 
                        "I'd like to see you try! You can't stop me!", 
                        "You come for my son and you expect me to back down? NO! I'm not having it!", 
                        "I know who you are. The police were saying you blew up the factory. That’s the reason why you joined the mafia, isn't it?", 
                        "You must've figured out pretty early on that my son, Griswold, blew up that building.", 
                        "Let me guess: no one believed you, but the mafia had plenty of information enough for you to find out about me, huh?", 
                        "But do you really know who you're working for? The chicken mafia? They're animals!", 
                        "If only you knew about things they've been doing...", 
                        "I was chased out of my own home by the IRS. I had no choice but to escape… and when I arrived here in Chickensas City? I was immediately forced into servitude by the Chicken Mafia!", 
                        "I bargain for my life and my sons life by handling the smuggling of nuggets to the Fox Continent.", 
                        "Those nuggets... what do you think they are?", 
                        "The Fox Continent is facing a severe food shortage--they could come and declare war on you in a second if they wanted to! Nonetheless, they are willing to negotiate for peace with chickens as long as they receive nuggets.", 
                        "Those nuggets, they certainly aren't made of gold!",
                        "And those Chickpeas the mafia manufacture in their factories to give out. You think they're doing that out of the goodness of their hearts?", 
                        "It's all about controlling the masses. Those savages.", 
                        "Well you know what? All those chickens I killed? I did it because I liked it! And I'd do it all again!", 
                    ],
					"condition": {
						"quest": "kill_burghert",
						"questActive": true,
					},
					"quest": "kill_burghert",
					"questTask": 2,
					"questTaskSet": 1,
					"to": "monologue-end",
				},
				{
					"id": "monologue-end",
					"text": [
						"But you... we aren't so different, you and I.",
						"We're both morally flexible, we both have reptile friends.",
						"Together, we can destroy them. What do you say? Will you join me?"
					],
					"condition": {"isResponse": true},
					"quest": "kill_burghert",
					"questTask": 3,
					"questTaskSet": 1,
					"warp": "end",
				},
				{
					"text": [
						"I love my son. I'll kill anyone who tries to harm him.",
						"No one can stop us! Not you, not the mafia, and not the IRS!"
					],
				},
			]
		}
	},

    "warps": {
		"burghertsLairExit": {
			"to": "hub",
			"fromWarp": "burghertsLairEntrance",
			"facing": "left",
			"x": 952,
			"y": 416,
			"w": 20,
			"h": 60,
			"sound": "door"
		}
	},

    "sprites": {
		// Layer: Suspicious Box of Radiation
		"factoryLayer": {
			"image": "burghertslair_layer.png",
			"framesx": 1,
			"framesy": 1,
			"w": 160,
			"h": 160,
			"x": 740,
			"y": 225,
			"worldy": 331
		}
	},
}
